---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.Cities
source: html/6fc2afc3-3ea7-1b4a-c595-d03c09e70d19.htm
---
# Autodesk.Revit.ApplicationServices.Application.Cities Property

Returns a set of all the known city locations within Revit.

## Syntax (C#)
```csharp
public CitySet Cities { get; }
```

## Remarks
Each city has information about longitude, latitude etc.